Repository: sandsmark/kde1-kmorph
Catalog: po/*_kmorph.po
Languages: de

source: Source-picture:
de: Quellbild:

source: Destination-picture:
de: Zielbild:

source: Resultnamemask:
de: Res.namenmaske:

source: Startnumber:
de: Startindex:

source: Endnumber:
de: Endindex:

source: Warpstart:
de: Warpstartindex:

source: Warpend:
de: Warpendindex:

source: Warp only
de: Nur Warp

source: Colormixstart:
de: Überblendstart:

source: Colormixend:
de: Überblendende:

source: Reload pictures
de: Lade Bilder neu

source: No Project!
de: Kein Projekt!

source: New
de: Neu

source: Open
de: Öffnen

source: Save
de: Speichern

source: Save As
de: Speichern als

source: Open sourcepicture
de: Öffne Quellbild

source: Open dest.picture
de: Öffne Zielbild

source: Exit
de: Beenden

source: Render
de: Berechnen

source: Help
de: Hilfe

source: About
de: Info

source: &File
de: &Datei

source: &Edit
de: &Bearbeiten

source: &Help
de: &Hilfe

source: Stop
de: Anhalten

source: New Project!
de: Neues Projekt!

source: Cannot open file!
de: Kann Datei nicht öffnen!

source: Is not a kmorph-file!
de: Keine Kmorphdatei!

source: Project loaded!
de: Projekt geladen!

source: Cannot open project for writing!
de: Kann Projekt nicht zum Schreiben öffnen!

source: Project saved!
de: Projekt gespeichert!

source: Cannot open file:
de: Kann Datei nicht öffnen:

source: File
de: Datei

source: is no PPM format!
de: ist kein PPM Format!

source: Out of memory!
de: Zu wenig Speicher frei!

source: Cannot open file for writing:
de: Kann Datei nicht zum Schreiben öffnen:

source: Cannot reload sourcepicture!
de: Kann Quellbild nicht neu laden!

source: Cannot reload destinationpicture!
de: Kann Zielbild nicht neu laden!

source: Pictures reloaded!
de: Bilder neu geladen!

source: Rendering stopped!
de: Berechnung gestopt!

source: Render frame
de: Berechne Bild

source: line
de: Zeile

source: of
de: von

source: Render done!
de: Berechnung fertig!

source: Help not available yet!
de: Hilfe noch nicht möglich!

source: Sorry!
de: Leider!

source: kmorph.html
de: de_kmorph.html

source: Author:
de: Autor:

source: Quit
de: Fertig

source: Close editor
de: Editor schließen

source: Select vector
de: Vektor auswählen

source: Add vector
de: Vektor hinzufügen

source: Select previous vector
de: vorherigen Vektor auswählen

source: Select next vector
de: nächsten Vektor auswählen

source: Delete vector
de: Vektor löschen

source: Gray / Color display
de: Grau- / Farbanzeige
